---
kind: method
id: M:Autodesk.Revit.DB.DGNImportOptions.#ctor
source: html/43129592-46c2-2082-e54d-f3eb6276d42e.htm
---
# Autodesk.Revit.DB.DGNImportOptions.#ctor Method

Constructs a new instance of DGNImportOptions with default values of all properties.

## Syntax (C#)
```csharp
public DGNImportOptions()
```